ADRX DS 50 ;декларација на поле ADRX со 50 елементи
ADRZ DS 50 ;декларација на поле ADRZ со 50 елементи
ADRY DS 50 ;декларација на поле ADRY со 50 елементи
 N DS 1 ;дефинирање на еднобајтна променлива N
 MVI A,30d ;Иницијализација на N на 30
 STA N
 LXI B,ADRZ ;BC регистарскиот пар се полни со адресата на ADRZ
 LXI D,ADRY ;DE регистарскиот пар се полни со адресата на ADRY
 LXI H,ADRX ;HL регистарскиот пар се полни со адресата на ADRX
VRTI: MVI A,10d
 STAX B ;се сместува 10 како елемент на полето ADRZ (индиректно преку BC)
 LDAX D ;во ACC се вчитува елементот од ADRY полето (индиректно преку DE)
 RLC ; множење со 4
 RLC
 MOV M,A ;тоа што е во ACC се сместува во полето ADRX (индиректно преку HL)
 INX B ;BC покажува на наредниот елемент од полето ADRZ
 INX D ;DE покажува на наредниот елемент од полето ADRY
 INX H ;HL покажува на наредниот елемент од полето ADRX
 LDA N
 DCR A ;намали го бројачот за 1.
 STA N
JNZ VRTI ;се додека бројачот е различен од 0.
